In [2]:
import pandas as pd

In [5]:
data = pd.read_csv(r'C:\Users\omc\Desktop\us-baby-names-release-2015-12-18-00-53-48\output\StateNames.csv')

In [7]:
data.head()

   Id      Name  Year Gender State  Count
0   1      Mary  1910      F    AK     14
1   2     Annie  1910      F    AK     12
2   3      Anna  1910      F    AK     10
3   4  Margaret  1910      F    AK      8
4   5     Helen  1910      F    AK      7

## Problems :
1. Find Total Number of Anna
2. What is the Trend of folks having name Anna
3. Find male vs female birth ratio
4. Male vs Female births over the year

In [36]:
%timeit data_anna = data[data['Name']=='Anna']

1 loop, best of 3: 1.3 s per loop

In [26]:
#sol of 1 : by using Mask
data_anna.count()

Id        5314
Name      5314
Year      5314
Gender    5314
State     5314
Count     5314
dtype: int64

In [25]:
data_anna.shape

(5314, 6)

In [29]:
data_indexed = data.set_index('Name')

In [37]:
#sol 1 : by using loc
%timeit data_anna_1 = data_indexed.loc['Anna']

1 loop, best of 3: 322 ms per loop

In [41]:
data_anna_1.count()

Id        5314
Year      5314
Gender    5314
State     5314
Count     5314
dtype: int64

In [43]:
data_anna_1.head()

       Id  Year Gender State  Count
Name
Anna    3  1910      F    AK     10
Anna   18  1912      F    AK      7
Anna   54  1915      F    AK     10
Anna   76  1916      F    AK      7
Anna  101  1917      F    AK      5

In [46]:
#sol for 2: 
data_anna_year = data_anna_1.groupby('Year')

In [96]:
# data_anna_year.size()

In [52]:
data.head()

   Id      Name  Year Gender State  Count
0   1      Mary  1910      F    AK     14
1   2     Annie  1910      F    AK     12
2   3      Anna  1910      F    AK     10
3   4  Margaret  1910      F    AK      8
4   5     Helen  1910      F    AK      7

In [61]:
# help(data.groupby)
data_male_female = data.groupby('Year')['Gender']

In [65]:
# data_male_female.size()

In [77]:
data_female = data.loc[data['Gender'] == 'F']

In [100]:
# help(data_female.describe)
temp = data_female.groupby('Year')['Gender']
# temp.size()

In [129]:
temp = data.groupby(['Year','Gender'])
# temp.size()

In [117]:
data_index_byYear = data.set_index('Year')

In [128]:
#Birth Rate per Year
data_index_byYear.groupby('Year').size().head()

Year
1910    16830
1911    17621
1912    23179
1913    25277
1914    28822
dtype: int64